<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"8c9d433ed3d3e60c39f4ebef158f693f570bad71c745997361fecd1a1c3a2f5f","plan_job_ref":"Job Test actions using target and replace #463 at https://github.com/dflook/terraform-github-actions/actions/runs/13837103990","plan_out_hash":"038462c27282d710e3bd2e9d698f22e81824e2a5654bd2ad0f10bebcc519dec9","plan_hash":"d376f6479ba3c4c857ccf2de6cfd3c982dbbb1021c6d1e20f123ca75a7164300","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "oYRtKOeQFK" -> (known after apply)
!~  foreach = "gCuWgnH6aT" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #463](https://github.com/dflook/terraform-github-actions/actions/runs/13837103990)